In [7]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt

In [8]:
data=pd.read_csv('C:/Users/ashly/Downloads/archive (8)/rank_salary.csv')
data

              Position  Level   Salary
0  Teaching Assistants      1    45000
1        Guest Faculty      2    50000
2  Contractual Faculty      3    60000
3  Assistant Professor      4    80000
4  Associate Professor      5   110000
5            Professor      6   150000
6       Associate Dean      7   200000
7                 Dean      8   300000
8      Vice Chancellor      9   500000
9           Chancellor     10  1000000

In [9]:
data['Position']=data['Position'].astype('category')
data['Position']=data['Position'].cat.codes
data

   Position  Level   Salary
0         8      1    45000
1         6      2    50000
2         4      3    60000
3         0      4    80000
4         2      5   110000
5         7      6   150000
6         1      7   200000
7         5      8   300000
8         9      9   500000
9         3     10  1000000

In [1]:
x=data.drop(columns='Salary')
y=data['Salary']

NameError: name 'data' is not defined

In [13]:
x.shape

(10, 2)

In [14]:
y.shape

(10,)

In [29]:
from sklearn.preprocessing import PolynomialFeatures
from sklearn.linear_model import LinearRegression

poly=PolynomialFeatures(degree=3,include_bias=False)
reg=LinearRegression()

x_poly=poly.fit_transform(x)


reg.fit(x_poly,y)
y_pred=reg.predict(x_poly)

In [30]:
from sklearn.metrics import mean_squared_error,r2_score

In [31]:
mse=mean_squared_error(y,y_pred)
r2=r2_score(y,y_pred)

In [32]:
mse

1.3231278052361351e-15

In [33]:
r2

1.0